givng_server/app/controllers/givngs_controller.rb

  def index
    @givngs = Givng.all
---
SELECT "givngs".* FROM "givngs"