givng_server/app/controllers/users_controller.rb

INSERT INTO "users" ("email", "password_digest", "name", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)
---
  def create
    form_params = get_create_user_form_params()

    @user = User.new(form_params)
    if @user.save