givng_server/app/controllers/users_controller.rb

INSERT INTO "users" ("email", "password_digest", "name", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)
---
  def create_user
      userParams = params.require(:user)
        .permit(:name, :email, :password, :password_confirmation)
      user = User.new(userParams);
        if user.save()

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 13], ["LIMIT", 1]]
---
  def get_by_id

      # the user_id param comes from our route
      user = User.find(params[:user_id])

SELECT "users".* FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", "henryhe@hitv.com.au"], ["LIMIT", 1]]
---
  def get_token
     # Get the user by email
        user = User.find_by_email(params[:email])